{
  "entries": [
    {
      "id": 1,
      "date": "2019-09-30",
      "concept": "First Day Back at NSS",
      "content": "Today I started Front-End over again with cohort 36. It was a little bit of a shock at first. Going through the initial set up and the same talks. Introducing everyone. Learning new faces. At first, I was disheartened, thinking I should've stayed with 34. That's a great cohort and I got used to my teammates! At the same time, moving to a new cohort simulates what it will be like to spend time with a team and then transition out and into a new one. I'm looking forward to the next three months to really solidify concepts from Front-End, but then I'm looking forward to doing Back-End. Python/Django is supposed to be a lot of fun. I'm ready to get back into React. This time I'll knock my capstone out of the park. NSS is a great adventure. I'm so grateful for this school.",
      "mood": "Hopeful"
    },
    {
      "id": 3,
      "date": "2019-10-10",
      "concept": "JavaScript Objects",
      "content": "I needed some extra practice with JavaScript Objects and Arrays and pulling data out of them to output the correct info in the console.",
      "mood": "Frustrated"
    },
    {
      "id": 4,
      "date": "2019-10-28",
      "concept": "Welcome To Nashville, Group Project",
      "content": "Last week we wrapped up our Welcome To Nashville group project and presented it to Jisie. This project was the most challenging one I've worked on thus far. The mixture of personalities is different. The cohort dynamic is different. I'm an inward person. I feel situations and other people. I tend to hold the emotions of other people. I'm not a very good teacher because my patience is lacking, especially right now. I wasn't in the best mood during our standup one morning and became frustrated with a peer who, at the time, I felt was holding up our progress as a team. We kept backtracking and reiterating the same plan, which was to get from point A to point B. Long story short, I should've taken more breaks to release the frustration. Taken more deep breaths. Found more space for understanding. Not taking responsiblity for the group. I'm learning a lot at Nashville Software School. It goes well beyond the code. I'm grateful for this experience. I think I'll be one hell of a developer some day.",
      "mood": "Tanked"
    },
    {
      "date": "2019-10-30",
      "concept": "Coding from Home",
      "content": "I'm working from home today. I prefer to say working as opposed to schoolwork. It's basically the same thing, and it gets me into the mindset of this being life now. Get up. Get ready. Get kids ready. Coffee. Drop off. Commute. Spend the day. Commute home. Dinner. Quality time. Bedtime. More work. Sleep. Repeat. Day in and day out. The thing is, I really love it! It's different and new. Being a stay-at-home mom, time belonged to me and the kids. Now it belongs to school and career. Things come up. Kids get sick. You code from home in a tiny office under the stairs. It's not a perfect life, but it's a good one. I wouldn't change it for anything. ",
      "mood": "Zen",
      "id": 5
    },
    {
      "date": "2019-10-31",
      "concept": "Radio Buttons",
      "content": "While logging in this journal, I'm also building it to include more functionality. As of now, I can save new entries, such as this one. The event handler on the \"Record Journal Entry\" button saves the entry to the database in my API and a new list of all the entries, including the new one, populates on the dom. I am confident in where I am at this point. As long as I stay focused and on top of lessons and practice exercises, I can not only retain these concepts, but I enjoy writing the logic. Becoming a developer doesn't disappoint. And now, to work on \"edit\". I'll use this entry as practice.",
      "mood": "Hopeful",
      "id": 6
    },
    {
      "date": "2019-11-02",
      "concept": "Code Works!",
      "content": "My journal is now a fully-functioning CRUD app written in vanilla javascript. Cool!",
      "mood": "Zen",
      "id": 7
    }
  ]
}