{
  "entries": [
    {
      "id": 1,
      "date": "September 30, 2019",
      "concept": "First Day Back at NSS",
      "content": "Today I started Front-End over again with cohort 36. It was a little bit of a shock at first. Going through the initial set up and the same talks. Introducing everyone. Learning new faces. At first, I was disheartened, thinking I should've stayed with 34. That's a great cohort and I got used to my teammates! At the same time, moving to a new cohort simulates what it will be like to spend time with a team and then transition out and into a new one. I'm looking forward to the next three months to really solidify concepts from Front-End, but then I'm looking forward to doing Back-End. Python/Django is supposed to be a lot of fun. I'm ready to get back into React. This time I'll knock my capstone out of the park. NSS is a great adventure. I'm so grateful for this school.",
      "mood": "Hopeful"
    },
    {
      "id": 2,
      "date": "October 8, 2019",
      "concept": "Group Project, Celebrity Tribute",
      "content": "I finished my page of our application, which was News and Events. Our group worked well together to coordinate on colors and the styling of our Nav Bar and Footer. I'm pleased with the outcome of my page. I learned how to import icons as images wrapped in anchor tags that hyperlink to other websites. I felt like I grew in my CSS abilities on this project, as well as learning to be the person who has answers instead of feeling like I'm behind always having to ask someone else for answers. It will be interesting to see how repeating Front-End progresses.",
      "mood": "Zen"
    },
    {
      "id": 3,
      "date": "October 10, 2019",
      "concept": "JavaScript Objects",
      "content": "I needed some extra practice with JavaScript Objects and Arrays and pulling data out of them to output the correct info in the console.",
      "mood": "Frustrated"
    },
    {
      "id": 4,
      "date": "October 28, 2019",
      "concept": "Welcome To Nashville, Group Project",
      "content": "Last week we wrapped up our Welcome To Nashville group project and presented it to Jisie. This project was the most challenging one I've worked on thus far. The mixture of personalities is different. The cohort dynamic is different. I'm an inward person. I feel situations and other people. I tend to hold the emotions of other people. I'm not a very good teacher because my patience is lacking, especially right now. I wasn't in the best mood during our standup one morning and became frustrated with a peer who, at the time, I felt was holding up our progress as a team. We kept backtracking and reiterating the same plan, which was to get from point A to point B. Long story short, I should've taken more breaks to release the frustration. Taken more deep breaths. Found more space for understanding. Not taking responsiblity for the group. I'm learning a lot at Nashville Software School. It goes well beyond the code. I'm grateful for this experience. I think I'll be one hell of a developer some day.",
      "mood": "Tanked"
    },
    {
      "date": "October 30, 2019",
      "concept": "Coding from Home",
      "content": "I'm working from home today. I prefer to say working as opposed to schoolwork. It's basically the same thing, and it gets me into the mindset of this being life now. Get up. Get ready. Get kids ready. Coffee. Drop off. Commute. Spend the day. Commute home. Dinner. Quality time. Bedtime. More work. Sleep. Repeat. Day in and day out. The thing is, I really love it! It's different and new. Being a stay-at-home mom, time belonged to me and the kids. Now it belongs to school and career. Things come up. Kids get sick. You code from home in a tiny office under the stairs. It's not a perfect life, but it's a good one. I wouldn't change it for anything. ",
      "mood": "Zen",
      "id": 5
    },
    {
      "date": "October 30, 2019",
      "concept": "Jane at the kitchen table after school.",
      "content": "I showed Jane my cool journal app. She thought it was pretty cool. Coming from a fifteen-year-old, I'd call that a good review. She's awesome like that.",
      "mood": "Zen",
      "id": 6
    }
  ]
}